# Используем официальный образ Python как базовый
FROM python:3.9-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Устанавливаем переменную окружения для предотвращения создания кэша .pyc файлов
ENV PYTHONDONTWRITEBYTECODE=1
# Устанавливаем переменную окружения для вывода логов в консоль
ENV PYTHONUNBUFFERED=1

# Копируем файлы зависимостей
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальной код приложения
COPY . .

# Указываем порт, который будет использоваться приложением
EXPOSE 5000

# Команда для запуска приложения
CMD ["python", "app.py"]